Куращенко Лев
Отчет по Лабораторной работе №1
ОПРЕДЕЛЕНИЕ ВРЕМЕНИ РАБОТЫ ПРИКЛАДНЫХ ПРОГРАММ

Цели работы
1. Изучение методики измерения времени работы подпрограммы.
2. Изучение приемов повышения точности измерения времени работы
подпрограммы.
3. Изучение способов измерения времени работы подпрограммы.
4. Измерение времени работы подпрограммы в прикладной программе.

Вариант задания - задача 1:
Алгоритм вычисления числа Пи с помощью разложения в ряд (ряд
Грегори-Лейбница) по формуле Лейбница N первых членов ряда

Мною был выбран метод измерения с помощью clock_gettime.

Код программы (Реализация)
#include <stdio.h>
#include <time.h> // for clock_gettime
int main(){
struct timespec start, end;
clock_gettime(CLOCK_MONOTONIC_RAW, &start);
long long int  N = 2100000000;
        double pi = 0;
        double delta = 0;
for (int i = 0; i < N; i++){
                delta = (double)4/(double)(2*i+1);
                if (i % 2 == 1)
                        delta = -delta;
                pi += delta;
        }
//      cout <<endl<<"Pi is "<<setprecision(10)<<pi<< endl;
clock_gettime(CLOCK_MONOTONIC_RAW, &end);
printf("Time taken: %lf sec.\n",
end.tv_sec-start.tv_sec
+ 0.000000001*(end.tv_nsec-start.tv_nsec));
return 0;
}

Результаты измерений:
14,499
14,496
14,492
14,495
14,496
14,496
14,497
14,492
14,496
14,490

Приблизительное врремя 14,490
Абсолютная погрешность 0,001 (Погрешность таймера)
Относительная погрешность 3,1 * E-4